Merge branch 'merge/v2/deployment-optimizations' into v2-pablosal-merge-deployment-changes
